app/controllers/attendees_controller.rb

	def index
		@attendees = @event.attendees.all
---
SELECT * FROM "attendees" WHERE ("attendees".event_id = 3)

  def create
    @attendee = Attendee.new(params[:attendee])
		@attendee.event = @event
    respond_to do |format|
      if @attendee.save
---
INSERT INTO "attendees" ("name", "created_at", "event_id", "notes", "updated_at", "user_id", "attended", "norsvp") VALUES('brendan', '2010-05-27 16:35:32', NULL, 'test', '2010-05-27 16:35:32', NULL, 'f', 't')

  def update
    @attendee = Attendee.find(params[:id])
    respond_to do |format|
      if @attendee.update_attributes(params[:attendee])
---
SELECT * FROM "attendees" WHERE ("attendees"."id" = 12)
UPDATE "attendees" SET "attended" = 't', "updated_at" = '2010-05-28 09:25:23', "notes" = 'null' WHERE "id" = 14

  def destroy
    @attendee = Attendee.find(params[:id])
		oldid = @attendee.id
    @attendee.destroy
---
SELECT * FROM "attendees" WHERE ("attendees"."id" = 1)
DELETE FROM "attendees" WHERE "id" = 1