app/controllers/content_tags_controller.rb

  def index
    @tags = ContentTag.find(:all)
---
SELECT * FROM "content_tags" WHERE (pagename = 't') ORDER BY order_index

  def show
		@tag = ContentTag.find(params[:id])
---
SELECT * FROM "content_tags" WHERE (pagename = 't') ORDER BY order_index

  def edit
    @tag = ContentTag.find(params[:id])
---
SELECT * FROM "content_tags" WHERE (pagename = 't') ORDER BY order_index

  def create
    @tag = ContentTag.new(params[:content_tag])
    respond_to do |format|
      if @tag.save
---
INSERT INTO "content_tags" ("name", "created_at", "updated_at", "order", "pagename") VALUES('Karnivool', '2010-03-19 05:41:04', '2010-03-19 05:41:04', NULL, 't')

  def update
    @tag = ContentTag.find(params[:id])
    respond_to do |format|
      if @tag.update_attributes(params[:content_tag])
---
SELECT * FROM "content_tags" WHERE ("content_tags"."id" = 1)
UPDATE "content_tags" SET "updated_at" = '2010-03-19 05:39:03', "pagename" = 'f' WHERE "id" = 1

  def destroy
    @tag = ContentTag.find(params[:id])
    @tag.destroy
---
SELECT * FROM "content_tags" WHERE ("content_tags"."id" = 2)
DELETE FROM "content_tags" WHERE "id" = 4