app/controllers/content_pages_controller.rb

  def index
    @content_pages = ContentPage.all
---
SELECT * FROM "content_pages" WHERE (navbar = 't') ORDER BY order_index

  def show
    @content_page = ContentPage.find(params[:id])
---
SELECT * FROM "content_pages" WHERE (navbar = 't') ORDER BY order_index

  def create
    @content_page = ContentPage.new(params[:content_page])
    if @content_page.save
---
INSERT INTO "content_pages" ("name", "content_block_id", "created_at", "updated_at", "order_index", "home", "navbar", "content_tag_id") VALUES('News', NULL, '2010-03-31 12:28:46', '2010-03-31 12:28:46', NULL, 't', 't', NULL)

  def edit
    @content_page = ContentPage.find(params[:id])
---
SELECT * FROM "content_pages" WHERE (navbar = 't') ORDER BY order_index

  def update
    @content_page = ContentPage.find(params[:id])
    if @content_page.update_attributes(params[:content_page])
---
SELECT * FROM "content_pages" WHERE ("content_pages"."id" = 1)
UPDATE "content_pages" SET "updated_at" = '2010-03-31 14:55:31', "name" = 'about', "content_block_id" = 2 WHERE "id" = 2