app/controllers/content_viewer_controller.rb

SELECT * FROM "content_pages" WHERE ("content_pages"."name" = 'news') LIMIT 1
SELECT * FROM "content_pages" WHERE ("content_pages"."home" = 't') LIMIT 1
---
	def page
		@page = nil
		if params[:id] != nil
			@page = ContentPage.find_by_name(params[:id].downcase)
		else
			@page = ContentPage.find_by_home(true)

SELECT * FROM "content_blocks" WHERE ("content_blocks"."id" = 1) ORDER BY created_at desc
---
	def content
		@block = ContentBlock.find(params[:id])

SELECT * FROM "content_tags" WHERE ("content_tags"."name" = 'screenings') LIMIT 1
---
	def tag
		@tag = ContentTag.find_by_name(params[:id])