app/controllers/content_blocks_controller.rb

	def publish
		@block = ContentBlock.find(params[:id])
---
SELECT * FROM "content_blocks" WHERE ("content_blocks"."id" = 5) ORDER BY created_at desc

	def unpublish
		@block = ContentBlock.find(params[:id])
---
SELECT * FROM "content_blocks" WHERE ("content_blocks"."id" = 45) ORDER BY created_at desc

  def show
		@block = ContentBlock.find(params[:id])
---
SELECT * FROM "content_blocks" WHERE ("content_blocks"."id" = 1) ORDER BY created_at desc

  def edit
    @block = ContentBlock.find(params[:id])
---
SELECT * FROM "content_blocks" WHERE ("content_blocks"."id" = 1) ORDER BY created_at desc

  def create
    @block = ContentBlock.new(params[:content_block])
		@block.author = current_user
    respond_to do |format|
      if @block.save
---
INSERT INTO "content_blocks" ("created_at", "title", "editor_id", "updated_at", "bodytext", "summary", "author_id", "autosummarize") VALUES('2010-03-31 14:52:46', 'About GenghisCon', NULL, '2010-03-31 14:52:46', '.h1 What is GenghisCon?

  def update
    @block = ContentBlock.find(params[:id])
    respond_to do |format|
      if @block.update_attributes(params[:content_block])
---
SELECT * FROM "content_blocks" WHERE ("content_blocks"."id" = 1) ORDER BY created_at desc
UPDATE "content_blocks" SET "updated_at" = '2010-03-18 09:57:15', "summary" = 'We are pleased to announce blah blah blah blahblah blahblah blahblah blahblah blahblah blahblah blahblah blahblah blahblah blahblah blahblah blahblah blahbla...' WHERE "id" = 2

  def destroy
    @block = ContentBlock.find(params[:id])
    @block.destroy
---
SELECT * FROM "content_blocks" WHERE ("content_blocks"."id" = 4) ORDER BY created_at desc
DELETE FROM "content_blocks" WHERE "id" = 4