app/controllers/events_controller.rb

  def create
    @event = Event.new(params[:event])
    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "content_block_id", "created_at", "updated_at") VALUES(NULL, NULL, '2010-05-27 14:47:42', '2010-05-27 14:47:42')

  def update
    @event = Event.find(params[:id])
    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT * FROM "events" WHERE ("events"."id" = 2)
UPDATE "events" SET "updated_at" = '2010-05-27 14:49:55', "name" = 'Iron Man 2' WHERE "id" = 2

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT * FROM "events" WHERE ("events"."id" = 1)
DELETE FROM "events" WHERE "id" = 1