app/controllers/facebook_controller.rb

SELECT * FROM "content_pages" WHERE ("content_pages"."home" = 't') LIMIT 1
---
	def index
		@page = ContentPage.find_by_home(true)