app/controllers/index_controller.rb

	def section
		@section = ContentTag.find_by_name(params[:id].downcase)
---
SELECT * FROM "content_tags" WHERE ("content_tags"."name" = 'news') LIMIT 1