app/controllers/user_sessions_controller.rb

INSERT INTO "users" ("facebook_id", "single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "twitter_name", "openid_identifier", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "oauth_secret", "active_token_id", "persistence_token", "login_count", "twitter_id", "last_login_ip", "oauth_token", "login", "last_login_at", "email") VALUES(NULL, 'TxEf0ROWROoIH0uYsSD8', '2010-07-28 08:26:02', '2010-07-28 08:26:02', NULL, '_-twmnl7rWHwtAp5jOT1', '2010-07-28 08:26:02', 't', NULL, 0, '127.0.0.1', NULL, '2010-07-28 08:26:02', NULL, NULL, '125dbbbb7206df49172d85ebfa8ab67e784c163b711060b3c368805c9a23cd169b5571b340b3c5f42a917afb95cc5d9dbef09dc9f92f4a5e4f96df0a2e918f0b', 1, NULL, NULL, NULL, NULL, NULL, NULL)
---
  def create
    @user_session = UserSession.new(params[:user_session])
		@user_session.save do |result|