app/controllers/users_controller.rb

INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "openid_identifier", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES('ZiDcKY7NrdcwpYjEQHlF', '2010-02-26 14:46:02', '2010-02-26 14:46:02', '44e3ea719e59cbd98ee5f93d904e271415c4855ea9acb7a6fd3c2c62016a4b96b0a1977e1a0c5bd44bfcf89deef8d0f2e02e98cef19f31e7073535c244d8a406', 'xI_Wzb8EpNK08s4Al_5b', '2010-02-26 14:46:02', NULL, 0, '127.0.0.1', 'N2vD73dHEfI88CTB4Uxg', '2010-02-26 14:46:02', 'c467734d7076c8230359622316a5fa273281cdc25896aa5484c430f2dcf5bdbb80273e678566846052a6fd1b89f1d5f197f3ed1c6314526f25ab282e52b13a0e', 1, NULL, 'lordmortis', NULL, 'lordmortis@gmail.com')
---
	def create
	  @user = User.new(params[:user])
		if !verify_recaptcha(:model => @user, :message => "Sorry! We couldn't verify that you were a human :(")
			render :action => 'new'
		end
	  if @user.save

UPDATE "users" SET "updated_at" = '2010-07-16 14:45:24', "perishable_token" = 'aSsg3vE1L-LNOOlbQEZC', "last_request_at" = '2010-07-16 14:45:05', "oauth_token" = '20767876-pMyMHw7wr439y3Lq8JlYhRoV2E0AhDeAsoEF4BpBr', "oauth_secret" = '7owWj5cqbduhEPNWpgfGgUgbza3NTtamUSJwfiVPqs' WHERE "id" = 1
---
	def update
	  @user = current_user
		@user.attributes = params[:user]
	  if @user.save